{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "trainable": true, "output_shape_type": "raw", "output_shape": null, "arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009c\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "name": "convolution2d_1", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 24, "trainable": true, "subsample": [2, 2], "nb_row": 5, "nb_col": 5, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "name": "convolution2d_2", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 36, "trainable": true, "subsample": [2, 2], "nb_row": 5, "nb_col": 5, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "name": "convolution2d_3", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 48, "trainable": true, "subsample": [2, 2], "nb_row": 5, "nb_col": 5, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "name": "convolution2d_4", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "border_mode": "same", "nb_filter": 64, "trainable": true, "subsample": [2, 2], "nb_row": 3, "nb_col": 3, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "bias": true, "init": "glorot_uniform", "name": "convolution2d_5", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "trainable": true, "subsample": [2, 2], "nb_row": 3, "nb_col": 3, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 80, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "trainable": true, "input_dim": 64, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 40, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "trainable": true, "input_dim": 80, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 16, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "trainable": true, "input_dim": 40, "name": "dense_3", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "trainable": true, "input_dim": 16, "name": "dense_4", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "bias": true, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "trainable": true, "input_dim": 10, "name": "dense_5", "activity_regularizer": null}}]}