{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "input_dtype": "float32", "cropping": [[60, 20], [1, 1]], "batch_input_shape": [null, 160, 320, 3], "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "arguments": {}, "trainable": true, "output_shape_type": "raw", "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s7\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000j\u0002\u0000j\u0003\u0000|\u0000\u0000d\u0006\u0000\u0083\u0002\u0000}\u0002\u0000|\u0002\u0000d\u0004\u0000\u001bd\u0005\u0000\u0018}\u0002\u0000|\u0002\u0000S)\u0007N\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9@\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0004\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0003r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\u000b\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize\u009b\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\u0010\u0004\u0015\u0002\u000e\u0001", null, null]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "nb_filter": 24, "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "nb_filter": 36, "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "nb_filter": 48, "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "nb_col": 3, "nb_filter": 64, "bias": true, "border_mode": "same", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "nb_col": 3, "nb_filter": 64, "bias": true, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "subsample": [2, 2], "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": 64, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 80}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": 80, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 40}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": 40, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 16}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": 16, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 10}}, {"class_name": "Dense", "config": {"name": "dense_5", "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": 10, "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "output_dim": 1}}]}