{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "batch_input_shape": [null, 20, 64, 3], "beta_regularizer": null, "trainable": true, "name": "batchnormalization_1", "epsilon": 0.001, "momentum": 0.99, "mode": 0, "axis": 1, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_constraint": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "relu", "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 16, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 2], "b_constraint": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "relu", "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 24, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_constraint": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "relu", "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "nb_filter": 36, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_constraint": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 2, "bias": true, "activation": "relu", "name": "convolution2d_4", "activity_regularizer": null, "nb_row": 2, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_constraint": null, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 2, "bias": true, "activation": "relu", "name": "convolution2d_5", "activity_regularizer": null, "nb_row": 2, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 512, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "name": "dense_1", "input_dim": 1584, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "name": "dense_2", "input_dim": 512, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "name": "dense_3", "input_dim": 10, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null}}]}