{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s7\u0000\u0000\u0000d\u0001\u0000d\u0002\u0000l\u0000\u0000m\u0001\u0000}\u0001\u0000\u0001|\u0001\u0000j\u0002\u0000j\u0003\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0002\u0000|\u0002\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0002\u0000|\u0002\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0004\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0003r\b\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\f\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize\u00d0\u0000\u0000\u0000s\b\u0000\u0000\u0000\u0000\u0001\u0010\u0005\u0015\u0003\u000e\u0001", null, null], "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_1", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_2", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 5, "b_constraint": null, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "init": "glorot_uniform", "border_mode": "valid", "subsample": [2, 2], "name": "convolution2d_3", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "b_constraint": null, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_4", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "b_constraint": null, "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "name": "convolution2d_5", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 80, "init": "glorot_uniform", "input_dim": 1152, "name": "dense_1", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 40, "init": "glorot_uniform", "input_dim": 80, "name": "dense_2", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 16, "init": "glorot_uniform", "input_dim": 40, "name": "dense_3", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 10, "init": "glorot_uniform", "input_dim": 16, "name": "dense_4", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "output_dim": 1, "init": "glorot_uniform", "input_dim": 10, "name": "dense_5", "b_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "trainable": true, "bias": true}}]}